# CreateImgFromSymbol

```pascal
FUNCTION CreateImgFromSymbol(
				symbolName   : STRING;
				symbolHeight : INTEGER;
				symbolWidth  : INTEGER;
				symbolMargin : INTEGER;
				renderMode   : INTEGER;
				view         : INTEGER): HANDLE;
```

```python
def vs.CreateImgFromSymbol(symbolName, symbolHeight, symbolWidth, symbolMargin, renderMode, view):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symbolName|STRING|The name of the symbol to display.|
|symbolHeight|INTEGER|The height of the symbol to display.|
|symbolWidth|INTEGER|The width of the symbol to display.|
|symbolMargin|INTEGER|The margin of the symbol to display.|
|renderMode|INTEGER|The render mode in which to display the symbol.|
|view|INTEGER|The standard view in which to display the symbol.|

## Examples
```pascal
resultH := CreateImgFromSymbol('Example', 1, 2, 3, 10, 5);
```
```python
import vs

symbolName = 'MySymbol'
symbolHeight = 1
symbolWidth = 2
symbolMargin = 3
renderMode = 0
view = 10

symHandle = vs.CreateImgFromSymbol(symbolName, symbolHeight, symbolWidth, symbolMargin, renderMode, view)
if symHandle is not None:
    vs.Message('Created object handle: ' + str(symHandle))
```

## Version
Availability: from Vectorworks 2018

## Category
* Document Attributes